tsung_tests/simple.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>

  <servers>
    <server host="testing.qt8ymkzsu9.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="10" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>

    <arrivalphase phase="2" duration="10" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>

    <arrivalphase phase="3" duration="10" unit="second">
      <users arrivalrate="16" unit="second"/>
    </arrivalphase>

    <arrivalphase phase="4" duration="10" unit="second">
      <users arrivalrate="32" unit="second"/>
    </arrivalphase>

    <arrivalphase phase="5" duration="10" unit="second">
      <users arrivalrate="64" unit="second"/>
    </arrivalphase>

    <arrivalphase phase="6" duration="10" unit="second">
      <users arrivalrate="128" unit="second"/>
    </arrivalphase>

    <arrivalphase phase="7" duration="10" unit="second">
      <users arrivalrate="256" unit="second"/>
    </arrivalphase>
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="Read post feed as unauthenticated user" probability="30" type="ts_http">
      <request>
        <http url="/posts" version="1.1" method="GET"/>
      </request>
    </session>

    <session name="Read post feed as an authenticated user" probability="20" type="ts_http">
      <request>
        <dyn_variable name="authenticity_token"/>
        <http url="/" version="1.1" method="GET"/>
      </request>

      <thinktime random="true" value="2"/>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
        <var name="authenticity_token"/>
      </setdynvars>

      <request subst="true">
        <http url="/sessions" version="1.1" method="POST" contents="authenticity_token=%%_authenticity_token%%&amp;username=testuser2&amp;password=testpass2"/>
      </request>

      <request>
        <http url="/posts" version="1.1" method="GET"/>
      </request>
    </session>

    <session name="Create post as an unauthenticated user" probability="5" type="ts_http">
      <request>
        <http url="/posts" version="1.1" method="GET"/>
      </request>

      <request>
        <dyn_variable name="authenticity_token"/>
        <http url="/posts/new" version="1.1" method="GET"/>
      </request>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
        <var name="authenticity_token"/>
      </setdynvars>

      <!-- <thinktime random="true" value="2"/> -->

      <request subst="true">
        <dyn_variable name="created_post_id" re="Location: http://.*/posts/(.*)\r"/>
        <http url="/posts" version="1.1" method="POST" contents="authenticity_token=%%_authenticity_token%%&amp;post%5Bcaption%5D=post+2"/>
      </request>

      <request subst="true">
        <http url="/posts/%%_created_post_id%%"/>
      </request>
    </session>

    <session name="Create post as an authenticated user" probability="5" type="ts_http">
      <request>
        <http url="/posts" version="1.1" method="GET"/>
      </request>

      <request>
        <dyn_variable name="authenticity_token"/>
        <http url="/posts/new" version="1.1" method="GET"/>
      </request>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
        <var name="authenticity_token"/>
      </setdynvars>

      <!-- Session started for user. -->
      <request subst="true">
        <http url="/sessions" version="1.1" method="POST" contents="authenticity_token=%%_authenticity_token%%&amp;username=testuser&amp;password=testpass"/>
      </request>

      <!-- <thinktime random="true" value="2"/> -->

      <request subst="true">
        <dyn_variable name="created_post_id" re="Location: http://.*/posts/(.*)\r"/>
        <http url="/posts" version="1.1" method="POST" contents="authenticity_token=%%_authenticity_token%%&amp;post%5Bcaption%5D=post+2&amp;post%5Buser_id%5D=testuser"/>
      </request>

      <request subst="true">
        <http url="/posts/%%_created_post_id%%"/>
      </request>
    </session>

    <session name="Edit a post as an authenticated user" probability="5" type="ts_http">
      <request>
        <dyn_variable name="authenticity_token"/>
        <http url="/posts" version="1.1" method="GET"/>
      </request>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
        <var name="authenticity_token"/>
      </setdynvars>

      <!-- Session started for user. -->
      <request subst="true">
        <http url="/sessions" version="1.1" method="POST" contents="authenticity_token=%%_authenticity_token%%&amp;username=testuser&amp;password=testpass"/>
      </request>

      <request>
        <http url="/users/1" version="1.1" method="GET"/>
      </request>

      <request>
        <http url="/posts/1/edit" version="1.1" method="GET"/>
      </request>

      <thinktime random="true" value="2"/>

      <request subst="true">
        <dyn_variable name="edited_post_id" re="Location: http://.*/posts/(.*)\r"/>
        <http url="/posts/1" version="1.1" method="POST" contents="authenticity_token=%%_authenticity_token%%&amp;post%5Bcaption%5D=updated+caption+post+2"/>
      </request>

      <request subst="true">
        <http url="/posts/%%_edited_post_id%%"/>
      </request>
    </session>

    <session name="Send message" probability="15" type="ts_http">
      <request>
        <http url="/messages" version="1.1" method="GET"/>
      </request>

      <request>
        <dyn_variable name="authenticity_token"/>
        <http url="/messages/new" version="1.1" method="GET" />
      </request>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
        <var name="authenticity_token"/>
      </setdynvars>

      <request subst="true">
        <http url="/sessions" version="1.1" method="POST" contents="authenticity_token=%%_authenticity_token%%&amp;username=testuser&amp;password=password"/>
      </request>

      <request subst="true">
        <dyn_variable name="created_message_id" re="Location: http://.*/messages/(.*)\r"/>
        <http url="/messages" version="1.1" method="POST" contents="authenticity_token=%%_authenticity_token%%&amp;message%5Breceiver_id%5D=testuser2&amp;message%5Bbody%5D=whatup"/>
      </request>

      <request subst="true">
        <http url="/messages/%%_created_message_id%%"/>
      </request>
    </session>

    <session name="Commment on a post as an unauthenticated user" probability="5" type="ts_http">
      <request>
        <http url="/posts" version="1.1" method="GET"/>
      </request>

      <request>
        <dyn_variable name="authenticity_token"/>
        <http url="/posts/1" version="1.1" method="GET"/>
      </request>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
        <var name="authenticity_token"/>
      </setdynvars>

      <thinktime random="true" value="2"/>

     <request subst="true">
        <dyn_variable name="created_comment_id" re="Location: http://.*/comments/(.*)\r"/>
	      <http url="/comments" version="1.1" method="POST" contents="authenticity_token=%%_authenticity_token%%&amp;comment%5Bpost_id%5D=1&amp;comment%5Bcomment%5D=testing_comment"/>
     </request>

     <request>
       <dyn_variable name="authenticity_token"/>
       <http url="/posts/1" version="1.1" method="GET"/>
     </request>
    </session>

    <session name="Commment on a post as an authenticated user" probability="5" type="ts_http">
      <request>
        <http url="/posts" version="1.1" method="GET"/>
      </request>

      <request>
        <dyn_variable name="authenticity_token"/>
        <http url="/posts/1" version="1.1" method="GET"/>
      </request>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
        <var name="authenticity_token"/>
      </setdynvars>

      <!-- Session started for user. -->
      <request subst="true">
        <http url="/sessions" version="1.1" method="POST" contents="authenticity_token=%%_authenticity_token%%&amp;username=testuser&amp;password=password"/>
      </request>

      <thinktime random="true" value="2"/>

      <request subst="true">
        <dyn_variable name="created_comment_id" re="Location: http://.*/comments/(.*)\r"/>
        <http url="/comments" version="1.1" method="POST" contents="authenticity_token=%%_authenticity_token%%&amp;comment%5Buser_id%5D=testuser&amp;comment%5Bpost_id%5D=1&amp;comment%5Bcomment%5D=testing_comment"/>
     </request>

     <request>
       <dyn_variable name="authenticity_token"/>
       <http url="/posts/1" version="1.1" method="GET"/>
     </request>
    </session>

    <session name="Edit a comment as an authenticated user" probability="5" type="ts_http">
      <request>
        <dyn_variable name="authenticity_token"/>
        <http url="/" version="1.1" method="GET"/>
      </request>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
        <var name="authenticity_token"/>
      </setdynvars>

      <!-- Session started for user. -->
      <request subst="true">
        <http url="/sessions" version="1.1" method="POST" contents="authenticity_token=%%_authenticity_token%%&amp;username=testuser2&amp;password=testpass2"/>
      </request>

      <request>
        <http url="/users/2" version="1.1" method="GET"/>
      </request>

      <request>
        <http url="/comments" version="1.1" method="GET"/>
      </request>

      <request>
        <http url="/comments/1/edit" version="1.1" method="GET"/>
      </request>

      <thinktime random="true" value="2"/>

      <request subst="true">
        <dyn_variable name="post_id" re="Location: http://.*/posts/(.*)\r"/>
        <http url="/comments/1" version="1.1" method="POST" contents="authenticity_token=%%_authenticity_token%%&amp;comment%5Bcomment%5D=updated+comment+post+1"/>
      </request>

      <request subst="true">
        <http url="/post/%%_post_id%%"/>
      </request>
    </session>

    <session name="New user sign up" probability="5" type="ts_http">
      <request>
        <dyn_variable name="authenticity_token"/>
        <http url="/signup" version="1.1" method="GET"/>
      </request>

      <thinktime random="true" value="2"/>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
        <var name="authenticity_token"/>
      </setdynvars>

      <setdynvars sourcetype="random_string" length="10">
        <var name="rnd_user" />
      </setdynvars>

      <setdynvars sourcetype="random_string" length="10">
        <var name="rnd_pass" />
      </setdynvars>

      <request subst="true">
        <dyn_variable name="created_user_id" re="Location: http://.*/users/(.*)\r"/>
        <http url="/users" version="1.1" method="POST" contents="authenticity_token=%%_authenticity_token%%&amp;user%5Bprofile_pic%5D=https%3A%2F%2Fih0.redbubble.net%2Fimage.425051630.0008%2Fflat%2C750x%2C075%2Cf-pad%2C750x1000%2Cf8f8f8.u3.jpg&amp;user%5Busername%5D=%%_rnd_user%%&amp;user%5Bpassword%5D=%%_rnd_pass%%"/>
      </request>

      <request subst="true">
        <http url="/users/%%_created_user_id%%"/>
      </request>
    </session>

    <session name="Existing user login" probability="10" type="ts_http">
      <request>
        <dyn_variable name="authenticity_token"/>
        <http url="/login" version="1.1" method="GET"/>
      </request>

      <thinktime random="true" value="2"/>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
        <var name="authenticity_token"/>
      </setdynvars>

      <request subst="true">
        <http url="/sessions" version="1.1" method="POST" contents="authenticity_token=%%_authenticity_token%%&amp;username=testuser&amp;password=password"/>
      </request>
    </session>
  </sessions>
</tsung>